## Plan Result (nonprod_general - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 9 to add, 4 to change, 9 to destroy.</code></pre>

* Update
  * azurerm_application_gateway.ag
  * azurerm_key_vault.atlassian_kv
  * azurerm_postgresql_flexible_server.atlassian-flex-server
  * azurerm_postgresql_server.atlassian-server[0]
* Replace
  * terraform_data.vm[&#34;atlassian-nonprod-confluence-02&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-confluence-04&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-crowd-01&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-gluster-01&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-gluster-02&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-gluster-03&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-jira-01&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-jira-02&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-jira-03&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault_secret.POSTGRES-FLEX-SERVER-PASS will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-FLEX-SERVER-PASS" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-FLEX-SERVER-PASS"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-FLEX-SERVER-USER will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-FLEX-SERVER-USER" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-FLEX-SERVER-USER"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-PASS will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-PASS" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-SINGLE-SERVER-PASS"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-USER will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-USER" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-SINGLE-SERVER-USER"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.admin_private_key will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "admin_private_key" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "test-private-key"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.admin_username will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "admin_username" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "vm-admin-username"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # azurerm_application_gateway.ag will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway"
        name                              = "atlassian-nonprod-app-gateway"
        tags                              = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)

      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-cnf" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-cnf" -> null
          - path                                      = "/confluence" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-crd" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-crd" -> null
          - path                                      = "/crowd" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-jira" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-jira" -> null
          - path                                      = "/jira/status" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-cnf"
          + path                                      = "/confluence"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-crd"
          + path                                      = "/crowd"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-jira"
          + path                                      = "/jira/status"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }

      - request_routing_rule {
          - http_listener_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/httpListeners/appgw-http-listener" -> null
          - http_listener_name          = "appgw-http-listener" -> null
          - id                          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/requestRoutingRules/appgw-routing-rule" -> null
          - name                        = "appgw-routing-rule" -> null
          - priority                    = 1 -> null
          - rule_type                   = "PathBasedRouting" -> null
          - url_path_map_id             = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/urlPathMaps/appgw-url-map-path" -> null
          - url_path_map_name           = "appgw-url-map-path" -> null
            # (8 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "appgw-backend-pool-cnf"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "appgw-backend-settings-cnf"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "appgw-http-listener"
          + id                          = (known after apply)
          + name                        = "appgw-routing-rule"
          + priority                    = 1
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "PathBasedRouting"
          + url_path_map_id             = (known after apply)
          + url_path_map_name           = "appgw-url-map-path"
            # (2 unchanged attributes hidden)
        }

        # (18 unchanged blocks hidden)
    }

  # azurerm_key_vault.atlassian_kv will be updated in-place
  ~ resource "azurerm_key_vault" "atlassian_kv" {
      ~ access_policy                   = [
            {
                application_id          = null
                certificate_permissions = []
                key_permissions         = []
                object_id               = "345d18cb-dabd-48f4-80fc-ea735abf14f1"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          + {
              + certificate_permissions = []
              + key_permissions         = []
              + object_id               = "345d18cb-dabd-48f4-80fc-ea735abf14f1"
              + secret_permissions      = [
                  + "Get",
                  + "List",
                  + "Set",
                  + "Delete",
                  + "Purge",
                ]
              + storage_permissions     = []
              + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
                # (1 unchanged attribute hidden)
            },
            {
                application_id          = null
                certificate_permissions = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "ManageContacts",
                    "ManageIssuers",
                    "GetIssuers",
                    "ListIssuers",
                    "SetIssuers",
                    "DeleteIssuers",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "GetRotationPolicy",
                    "SetRotationPolicy",
                    "Rotate",
                ]
                object_id               = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            # (2 unchanged elements hidden)
        ]
        id                              = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
        name                            = "atlasssian-nonprod-kv"
        tags                            = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_postgresql_flexible_server.atlassian-flex-server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "atlassian-flex-server" {
      ~ administrator_password            = (sensitive value)
        id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/atlassian-nonprod-flex-server"
        name                              = "atlassian-nonprod-flex-server"
        tags                              = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (18 unchanged attributes hidden)

      ~ authentication {
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_postgresql_server.atlassian-server[0] will be updated in-place
  ~ resource "azurerm_postgresql_server" "atlassian-server" {
      ~ administrator_login_password            = (sensitive value)
        id                                      = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/servers/atlassian-nonprod-server"
        name                                    = "atlassian-nonprod-server"
        tags                                    = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (17 unchanged attributes hidden)
    }

  # terraform_data.vm["atlassian-nonprod-confluence-02"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "45ea08a8-5265-d2cf-8f1d-d0eea0324618" -> (known after apply)
      ~ triggers_replace = [
          ~ "5006b1fa91d04c54fbe858bc9f50793d" -> "1e54e0f6cfa4928db7fe8a90cab20cb5",
          ~ "46379146df6d5b281e14fe98b086d64d" -> "75e66e6c0edc8557d17c02745d38faad",
          ~ "cf9779b276bfff900f5dc2678743d4c0" -> "a4c514831c4d9949aa6a6aebfca90c16",
          ~ "0dc600fb2026a77d83f69d1e2c808614" -> "5e0354478b5e7fa69736761e8f3ef90c",
          ~ "db3ea414fa35c8f779a892749de8badc" -> "62a68f819050bf2d74be628962765258",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-confluence-04"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "2441e1e0-d747-c09e-0b01-2ff2db3cd591" -> (known after apply)
      ~ triggers_replace = [
          ~ "5006b1fa91d04c54fbe858bc9f50793d" -> "1e54e0f6cfa4928db7fe8a90cab20cb5",
          ~ "46379146df6d5b281e14fe98b086d64d" -> "75e66e6c0edc8557d17c02745d38faad",
          ~ "cf9779b276bfff900f5dc2678743d4c0" -> "a4c514831c4d9949aa6a6aebfca90c16",
          ~ "0dc600fb2026a77d83f69d1e2c808614" -> "5e0354478b5e7fa69736761e8f3ef90c",
          ~ "db3ea414fa35c8f779a892749de8badc" -> "62a68f819050bf2d74be628962765258",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-crowd-01"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "8bcc7fd6-940c-da1e-73bb-8eb075768a03" -> (known after apply)
      ~ triggers_replace = [
          ~ "5006b1fa91d04c54fbe858bc9f50793d" -> "1e54e0f6cfa4928db7fe8a90cab20cb5",
          ~ "46379146df6d5b281e14fe98b086d64d" -> "75e66e6c0edc8557d17c02745d38faad",
          ~ "cf9779b276bfff900f5dc2678743d4c0" -> "a4c514831c4d9949aa6a6aebfca90c16",
          ~ "0dc600fb2026a77d83f69d1e2c808614" -> "5e0354478b5e7fa69736761e8f3ef90c",
          ~ "db3ea414fa35c8f779a892749de8badc" -> "62a68f819050bf2d74be628962765258",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-gluster-01"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "3d14110d-f856-4e30-df5a-2147465f8772" -> (known after apply)
      ~ triggers_replace = [
          ~ "5006b1fa91d04c54fbe858bc9f50793d" -> "1e54e0f6cfa4928db7fe8a90cab20cb5",
          ~ "46379146df6d5b281e14fe98b086d64d" -> "75e66e6c0edc8557d17c02745d38faad",
          ~ "cf9779b276bfff900f5dc2678743d4c0" -> "a4c514831c4d9949aa6a6aebfca90c16",
          ~ "0dc600fb2026a77d83f69d1e2c808614" -> "5e0354478b5e7fa69736761e8f3ef90c",
          ~ "db3ea414fa35c8f779a892749de8badc" -> "62a68f819050bf2d74be628962765258",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-gluster-02"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "9e405ecc-0188-3e53-3ea4-2c6a1f7e2f2e" -> (known after apply)
      ~ triggers_replace = [
          ~ "5006b1fa91d04c54fbe858bc9f50793d" -> "1e54e0f6cfa4928db7fe8a90cab20cb5",
          ~ "46379146df6d5b281e14fe98b086d64d" -> "75e66e6c0edc8557d17c02745d38faad",
          ~ "cf9779b276bfff900f5dc2678743d4c0" -> "a4c514831c4d9949aa6a6aebfca90c16",
          ~ "0dc600fb2026a77d83f69d1e2c808614" -> "5e0354478b5e7fa69736761e8f3ef90c",
          ~ "db3ea414fa35c8f779a892749de8badc" -> "62a68f819050bf2d74be628962765258",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-gluster-03"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "20aba650-2df0-112f-ec71-7e0b5829a850" -> (known after apply)
      ~ triggers_replace = [
          ~ "5006b1fa91d04c54fbe858bc9f50793d" -> "1e54e0f6cfa4928db7fe8a90cab20cb5",
          ~ "46379146df6d5b281e14fe98b086d64d" -> "75e66e6c0edc8557d17c02745d38faad",
          ~ "cf9779b276bfff900f5dc2678743d4c0" -> "a4c514831c4d9949aa6a6aebfca90c16",
          ~ "0dc600fb2026a77d83f69d1e2c808614" -> "5e0354478b5e7fa69736761e8f3ef90c",
          ~ "db3ea414fa35c8f779a892749de8badc" -> "62a68f819050bf2d74be628962765258",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-jira-01"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "c1cf9345-a46b-a7eb-a5fc-96497faff588" -> (known after apply)
      ~ triggers_replace = [
          ~ "5006b1fa91d04c54fbe858bc9f50793d" -> "1e54e0f6cfa4928db7fe8a90cab20cb5",
          ~ "46379146df6d5b281e14fe98b086d64d" -> "75e66e6c0edc8557d17c02745d38faad",
          ~ "cf9779b276bfff900f5dc2678743d4c0" -> "a4c514831c4d9949aa6a6aebfca90c16",
          ~ "0dc600fb2026a77d83f69d1e2c808614" -> "5e0354478b5e7fa69736761e8f3ef90c",
          ~ "db3ea414fa35c8f779a892749de8badc" -> "62a68f819050bf2d74be628962765258",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-jira-02"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "bd49e67c-5dc1-bf6b-d95c-0636c3b063c2" -> (known after apply)
      ~ triggers_replace = [
          ~ "5006b1fa91d04c54fbe858bc9f50793d" -> "1e54e0f6cfa4928db7fe8a90cab20cb5",
          ~ "46379146df6d5b281e14fe98b086d64d" -> "75e66e6c0edc8557d17c02745d38faad",
          ~ "cf9779b276bfff900f5dc2678743d4c0" -> "a4c514831c4d9949aa6a6aebfca90c16",
          ~ "0dc600fb2026a77d83f69d1e2c808614" -> "5e0354478b5e7fa69736761e8f3ef90c",
          ~ "db3ea414fa35c8f779a892749de8badc" -> "62a68f819050bf2d74be628962765258",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-jira-03"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "194b4e07-c177-f0e4-5b3c-5af8e2d3e795" -> (known after apply)
      ~ triggers_replace = [
          ~ "5006b1fa91d04c54fbe858bc9f50793d" -> "1e54e0f6cfa4928db7fe8a90cab20cb5",
          ~ "46379146df6d5b281e14fe98b086d64d" -> "75e66e6c0edc8557d17c02745d38faad",
          ~ "cf9779b276bfff900f5dc2678743d4c0" -> "a4c514831c4d9949aa6a6aebfca90c16",
          ~ "0dc600fb2026a77d83f69d1e2c808614" -> "5e0354478b5e7fa69736761e8f3ef90c",
          ~ "db3ea414fa35c8f779a892749de8badc" -> "62a68f819050bf2d74be628962765258",
        ]
    }

Plan: 9 to add, 4 to change, 9 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":79,"Program":"tfcmt","SHA1":"","Target":"nonprod_general - TerraformPlanApply","Vars":{}} -->